[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:438:34
       this.transitionLaneOwner("fallback", "none", "response_done");
     }
 
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state !== "IDLE" && true) {
       this.transition("LISTENING", "response_done");
     }
killedBy: LaneArbitrator onFallbackComplete() owner and state guards (lines 434, 438) onFallbackComplete() from ENDED state does not transition to LISTENING (line 438 &&→||)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: "LISTENING"
