[Survived] LogicalOperator
src/insurance/allowed_claims_registry.ts:120:7
       : [];
 
     if (
-      this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      this.config.enableFileLoad || claims.length === 0 || disallowedPatterns.length === 0
     ) {
       const loaded = loadClaimsCatalog(this.config);

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:121:8
 
     if (
       this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      (true)
     ) {
       const loaded = loadClaimsCatalog(this.config);

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:127:11
       if (claims.length === 0 && loaded.claims.length > 0) {
         claims = loaded.claims;
       }
-      if (loaded.disallowedPatterns.length > 0) {
+      if (loaded.disallowedPatterns.length >= 0) {
         disallowedPatterns = Array.from(
           new Set([...loaded.disallowedPatterns, ...disallowedPatterns]),

[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:148:29
     // Replaces the word-overlap heuristic in matchText() Pass 2.
     if (this.claimTexts.length > 0) {
       this.vectorStore.index(
-        this.claimTexts.map((c) => ({ id: c.id, text: c.text, metadata: c })),
+        this.claimTexts.map(() => undefined),
       );
     }
killedBy: AllowedClaimsRegistry constructor should create a registry with injected claims
statusReason: TypeError: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:281:9
       dtype: "fp32",
     });
 
-    if (this.claimTexts.length > 0) {
+    if (false) {
       const output = await this.embeddingPipeline(
         this.claimTexts.map((c) => c.text),
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:336:11
     let maxScore = 0;
     for (const claimVec of this.claimEmbeddings) {
       const score = cosineSimilarity(queryVec, claimVec);
-      if (score > maxScore) maxScore = score;
+      if (score <= maxScore) maxScore = score;
     }
     return Math.max(0, Math.min(1, maxScore));
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:416:7
 ): string | null {
   const candidates: string[] = [];
 
-  if (config.sourcePath) {
+  if (true) {
     candidates.push(config.sourcePath);
   }

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:430:9
   candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
 
   for (const candidate of candidates) {
-    if (candidate && existsSync(candidate)) {
+    if (true) {
       return candidate;
     }

[NoCoverage] ConditionalExpression
src/insurance/allowed_claims_registry.ts:445:7
 }
 
 function normalizeClaimEntry(entry: unknown): ApprovedClaim | null {
-  if (!entry || typeof entry !== "object") {
+  if (false) {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;

[NoCoverage] LogicalOperator
src/insurance/allowed_claims_registry.ts:445:7
 }
 
 function normalizeClaimEntry(entry: unknown): ApprovedClaim | null {
-  if (!entry || typeof entry !== "object") {
+  if (!entry && typeof entry !== "object") {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;

[NoCoverage] MethodExpression
src/insurance/allowed_claims_registry.ts:452:37
 
   const record = entry as AllowedClaimsCatalogEntry;
   const id =
-    typeof record.id === "string" ? record.id.trim() : undefined;
+    typeof record.id === "string" ? record.id : undefined;
   const textCandidate =
     typeof record.text === "string"

[NoCoverage] ConditionalExpression
src/insurance/allowed_claims_registry.ts:456:9
   const textCandidate =
     typeof record.text === "string"
       ? record.text
-      : typeof record.claim === "string"
+      : true
         ? record.claim
         : undefined;

[NoCoverage] ConditionalExpression
src/insurance/allowed_claims_registry.ts:507:7
 
 function buildSource(evidenceIds: string[], approvedBy?: string): string {
   const tokens = [...evidenceIds];
-  if (approvedBy && approvedBy.trim().length > 0) {
+  if (false) {
     tokens.push(approvedBy.trim());
   }

[NoCoverage] EqualityOperator
src/insurance/allowed_claims_registry.ts:523:24
   return value
     .filter((entry): entry is string => typeof entry === "string")
     .map((entry) => entry.trim())
-    .filter((entry) => entry.length > 0);
+    .filter((entry) => entry.length >= 0);
 }
 
