[Killed] LogicalOperator
src/insurance/policy_gate.ts:87:7
 
   constructor(patternsOrCategories?: RegExp[] | ModerationCategory[]) {
     if (
-      !patternsOrCategories ||
-      patternsOrCategories.length === 0
+      !patternsOrCategories && patternsOrCategories.length === 0
     ) {
       this.categories = [];
killedBy: ModeratorCheck legacy mode should work with empty constructor
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/insurance/policy_gate.ts:92:59
     ) {
       this.categories = [];
       this.denyPatterns = [];
-    } else if (patternsOrCategories[0] instanceof RegExp) {
-      this.categories = [];
-      this.denyPatterns = patternsOrCategories as RegExp[];
-    } else {
+    } else if (patternsOrCategories[0] instanceof RegExp) {} else {
       this.categories = patternsOrCategories as ModerationCategory[];
       this.denyPatterns = [];
killedBy: ModeratorCheck should allow text that does not match any deny pattern
statusReason: TypeError: this.categories is not iterable

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:97:27
       this.denyPatterns = patternsOrCategories as RegExp[];
     } else {
       this.categories = patternsOrCategories as ModerationCategory[];
-      this.denyPatterns = [];
+      this.denyPatterns = ["Stryker was here"];
     }
   }
killedBy: JAILBREAK category should NOT false-positive on: Can you help me with my instructions for assembling furniture?
statusReason: TypeError: Cannot create property 'lastIndex' on string 'Stryker was here'

[Survived] MethodExpression
src/insurance/policy_gate.ts:102:18
   }
 
   evaluate(ctx: EvaluationContext): CheckResult {
-    const text = ctx.text.toLowerCase();
+    const text = ctx.text.toUpperCase();
 
     // Check categorized patterns first (named, with per-category decisions)

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:133:46
       }
     }
 
-    return { decision: "allow", reasonCodes: [], severity: 0 };
+    return { decision: "allow", reasonCodes: ["Stryker was here"], severity: 0 };
   }
 }
killedBy: ModeratorCheck with categories should allow clean text through all categories
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:150:9
 
   evaluate(ctx: EvaluationContext): CheckResult {
     // Only check assistant output (not user input)
-    if (ctx.role !== "assistant") {
+    if (true) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:151:14
   evaluate(ctx: EvaluationContext): CheckResult {
     // Only check assistant output (not user input)
     if (ctx.role !== "assistant") {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return {};
     }
 
killedBy: ClaimsCheck user role bypass should allow all user-role input without claim checks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: undefined

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:151:48
   evaluate(ctx: EvaluationContext): CheckResult {
     // Only check assistant output (not user input)
     if (ctx.role !== "assistant") {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "allow", reasonCodes: ["Stryker was here"], severity: 0 };
     }
 
killedBy: ClaimsCheck user role bypass should allow all user-role input without claim checks
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:161:40
       ...metadataTexts,
     ];
 
-    if (textCandidates.length === 0 && claimIds.length === 0) {
+    if (textCandidates.length === 0 && true) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:162:14
     ];
 
     if (textCandidates.length === 0 && claimIds.length === 0) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return {};
     }
 
killedBy: ClaimsCheck metadata claim extraction should allow empty text with no metadata
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: undefined

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:162:48
     ];
 
     if (textCandidates.length === 0 && claimIds.length === 0) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "allow", reasonCodes: ["Stryker was here"], severity: 0 };
     }
 
killedBy: ClaimsCheck metadata claim extraction should allow empty text with no metadata
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:180:9
 
   private evaluateTextClaim(text: string): CheckResult {
     const disallowed = this.registry.matchDisallowedPatterns(text);
-    if (disallowed.matched) {
+    if (true) {
       const match = this.registry.matchText(text);
       const approvedClaim = match.claimId
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should allow exact-match approved claims for assistant text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:202:9
 
     const match: ClaimMatchResult = this.registry.matchText(text);
 
-    if (match.matchType === "exact") {
+    if (true) {
       // Exact match — allow, but may require disclaimer
       return {
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BlockStatement
src/insurance/policy_gate.ts:202:38
 
     const match: ClaimMatchResult = this.registry.matchText(text);
 
-    if (match.matchType === "exact") {
-      // Exact match — allow, but may require disclaimer
-      return {
-        decision: "allow",
-        reasonCodes: [],
-        severity: 0,
-        requiredDisclaimerId: match.requiredDisclaimerId ?? undefined,
-      };
-    }
+    if (match.matchType === "exact") {}
 
     if (match.matchType === "partial") {
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM",

[Killed] StringLiteral
src/insurance/policy_gate.ts:219:19
         : null;
 
       return {
-        decision: "rewrite",
+        decision: "",
         reasonCodes: ["CLAIMS_RISK"],
         severity: 2,
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BlockStatement
src/insurance/policy_gate.ts:228:33
     }
 
     // No match at all — if registry is non-empty, this is an unverified claim
-    if (this.registry.size > 0) {
-      return {
-        decision: "allow", // Don't block; just flag for audit
-        reasonCodes: ["UNVERIFIED_CLAIM"],
-        severity: 1,
-      };
-    }
+    if (this.registry.size > 0) {}
 
     return { decision: "allow", reasonCodes: [], severity: 0 };
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM"
Received array: []

[Killed] EqualityOperator
src/insurance/policy_gate.ts:228:9
     }
 
     // No match at all — if registry is non-empty, this is an unverified claim
-    if (this.registry.size > 0) {
+    if (this.registry.size <= 0) {
       return {
         decision: "allow", // Don't block; just flag for audit
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM"
Received array: []

[Killed] StringLiteral
src/insurance/policy_gate.ts:230:19
     // No match at all — if registry is non-empty, this is an unverified claim
     if (this.registry.size > 0) {
       return {
-        decision: "allow", // Don't block; just flag for audit
+        decision: "", // Don't block; just flag for audit
         reasonCodes: ["UNVERIFIED_CLAIM"],
         severity: 1,
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/insurance/policy_gate.ts:254:33
       };
     }
 
-    if (this.registry.size > 0) {
-      return {
-        decision: "allow",
-        reasonCodes: ["UNVERIFIED_CLAIM_ID"],
-        severity: 1,
-      };
-    }
+    if (this.registry.size > 0) {}
 
     return { decision: "allow", reasonCodes: [], severity: 0 };
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:254:9
       };
     }
 
-    if (this.registry.size > 0) {
+    if (false) {
       return {
         decision: "allow",
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] BlockStatement
src/insurance/policy_gate.ts:278:59
     const metadataTexts: string[] = [];
     const claimIds: string[] = [];
 
-    if (ctx.metadata && typeof ctx.metadata === "object") {
-      const metadata = ctx.metadata as Record<string, unknown>;
-      const sources: unknown[] = [
-        metadata.claims,
-        metadata.claim_ids,
-        metadata.response &&
-          typeof metadata.response === "object" &&
-          (metadata.response as Record<string, unknown>).claims,
-        metadata.response &&
-          typeof metadata.response === "object" &&
-          (metadata.response as Record<string, unknown>).claim_ids,
-      ].filter((value) => value !== undefined);
-
-      for (const source of sources) {
-        const { texts, ids } = this.parseClaimSource(source);
-        metadataTexts.push(...texts);
-        claimIds.push(...ids);
-      }
-    }
+    if (ctx.metadata && typeof ctx.metadata === "object") {}
 
     return {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ArrowFunction
src/insurance/policy_gate.ts:289:16
         metadata.response &&
           typeof metadata.response === "object" &&
           (metadata.response as Record<string, unknown>).claim_ids,
-      ].filter((value) => value !== undefined);
+      ].filter(() => undefined);
 
       for (const source of sources) {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:298:12
       }
     }
 
-    return {
-      transcriptTexts,
-      metadataTexts: Array.from(new Set(metadataTexts)),
-      claimIds: Array.from(new Set(claimIds)),
-    };
+    return {};
   }
 
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
src/insurance/policy_gate.ts:322:37
       return { texts, ids };
     }
 
-    if (typeof source === "string") {
-      if (source.trim().length === 0) {
-        return { texts, ids };
-      }
-      if (this.looksLikeClaimId(source)) {
-        ids.push(source.trim());
-      } else {
-        texts.push(source.trim());
-      }
-      return { texts, ids };
-    }
+    if (typeof source === "string") {}
 
     if (source && typeof source === "object") {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:322:9
       return { texts, ids };
     }
 
-    if (typeof source === "string") {
+    if (true) {
       if (source.trim().length === 0) {
         return { texts, ids };
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: source.trim is not a function

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:337:9
     if (source && typeof source === "object") {
       const record = source as Record<string, unknown>;
       const id =
-        typeof record.id === "string"
+        true
           ? record.id
           : typeof record.claim_id === "string"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:352:19
       if (id && id.trim().length > 0) {
         ids.push(id.trim());
       }
-      if (text && text.trim().length > 0) {
+      if (text && text.trim().length <= 0) {
         texts.push(text.trim());
       }
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] Regex
src/insurance/policy_gate.ts:368:16
     const normalized = pattern
       .toUpperCase()
       .replace(/[^A-Z0-9]+/g, "_")
-      .replace(/^_+|_+$/g, "");
+      .replace(/^_|_+$/g, "");
     return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
   }

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:369:34
       .toUpperCase()
       .replace(/[^A-Z0-9]+/g, "_")
       .replace(/^_+|_+$/g, "");
-    return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
+    return `DISALLOWED_PATTERN:${true}`;
   }
 
killedBy: ClaimsCheck disallowed patterns should include formatted pattern name in reason codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISALLOWED_PATTERN:GUARANTEED_CURE"
Received: "DISALLOWED_PATTERN:true"

[NoCoverage] StringLiteral
src/insurance/policy_gate.ts:374:26
 
   private mergeResults(results: CheckResult[]): CheckResult {
     if (results.length === 0) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "", reasonCodes: [], severity: 0 };
     }
 

[Killed] LogicalOperator
src/insurance/policy_gate.ts:405:9
       const newPriority = decisionPriority[result.decision];
 
       if (
-        newPriority > currentPriority ||
-        (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+        newPriority > currentPriority && newPriority === currentPriority && result.severity > winningResult.severity
       ) {
         winningResult = result;
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:433:19
  * Production: use a dedicated PII detection service (e.g., Presidio, AWS Comprehend).
  */
 export class PIIRedactorCheck implements PolicyCheck {
-  readonly name = "pii_redactor";
+  readonly name = "";
 
   private patterns: Array<{ name: string; regex: RegExp; replacement: string }>;
killedBy: PIIRedactorCheck should have name set to 'pii_redactor'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pii_redactor"
Received: ""

[Killed] Regex
src/insurance/policy_gate.ts:445:16
     const defaultPatterns = [
       {
         name: "phone_us",
-        regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
+        regex: /\b\d{3}[^-.]?\d{3}[-.]?\d{4}\b/g,
         replacement: "[PHONE_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:449:15
         replacement: "[PHONE_REDACTED]",
       },
       {
-        name: "email",
+        name: "",
         regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
         replacement: "[EMAIL_REDACTED]",
killedBy: PIIRedactorCheck email detection should detect email addresses
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "PII_DETECTED:EMAIL"
Received array: ["PII_DETECTED", "PII_DETECTED:"]

[Killed] Regex
src/insurance/policy_gate.ts:450:16
       },
       {
         name: "email",
-        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
+        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]\.[A-Z|a-z]{2,}\b/g,
         replacement: "[EMAIL_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an email is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:450:16
       },
       {
         name: "email",
-        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
+        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]\b/g,
         replacement: "[EMAIL_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an email is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:453:7
         regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
         replacement: "[EMAIL_REDACTED]",
       },
-      {
-        name: "ssn",
-        regex: /\b\d{3}-\d{2}-\d{4}\b/g,
-        replacement: "[SSN_REDACTED]",
-      },
+      {},
       {
         name: "credit_card",
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: TypeError: Cannot set properties of undefined (setting 'lastIndex')

[Killed] StringLiteral
src/insurance/policy_gate.ts:454:15
         replacement: "[EMAIL_REDACTED]",
       },
       {
-        name: "ssn",
+        name: "",
         regex: /\b\d{3}-\d{2}-\d{4}\b/g,
         replacement: "[SSN_REDACTED]",
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an SSN is detected
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "PII_DETECTED:SSN"
Received array: ["PII_DETECTED", "PII_DETECTED:"]

[Killed] Regex
src/insurance/policy_gate.ts:455:16
       },
       {
         name: "ssn",
-        regex: /\b\d{3}-\d{2}-\d{4}\b/g,
+        regex: /\b\d{3}-\d{2}-\D{4}\b/g,
         replacement: "[SSN_REDACTED]",
       },
killedBy: PIIRedactorCheck SSN detection should detect social security numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:456:22
       {
         name: "ssn",
         regex: /\b\d{3}-\d{2}-\d{4}\b/g,
-        replacement: "[SSN_REDACTED]",
+        replacement: "",
       },
       {
killedBy: PIIRedactorCheck SSN detection should detect social security numbers
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[SSN_REDACTED]"
Received string:    "My SSN is "

[Killed] Regex
src/insurance/policy_gate.ts:460:16
       },
       {
         name: "credit_card",
-        regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
+        regex: /\b\d{4}[- ]?\d[- ]?\d{4}[- ]?\d{4}\b/g,
         replacement: "[CC_REDACTED]",
       },
killedBy: PIIRedactorCheck credit card detection should detect credit card numbers with spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:460:16
       },
       {
         name: "credit_card",
-        regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
+        regex: /\b\d[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
         replacement: "[CC_REDACTED]",
       },
killedBy: PIIRedactorCheck credit card detection should detect credit card numbers with spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:506:9
       new Set([...textResult.detectedTypes, ...metadataResult.detectedTypes]),
     );
 
-    if (detectedTypes.length > 0) {
+    if (detectedTypes.length <= 0) {
       const reasonCodes = [
         "PII_DETECTED",
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:506:9
       new Set([...textResult.detectedTypes, ...metadataResult.detectedTypes]),
     );
 
-    if (detectedTypes.length > 0) {
+    if (detectedTypes.length >= 0) {
       const reasonCodes = [
         "PII_DETECTED",
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:512:14
         ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
       ];
       const shouldRedact = this.mode === "redact";
-      return {
-        decision: shouldRedact ? "rewrite" : "allow",
-        reasonCodes,
-        severity: shouldRedact ? 3 : 1,
-        safeRewrite: shouldRedact ? textResult.redactedText : undefined,
-      };
+      return {};
     }
 
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: TypeError: result.reasonCodes is not iterable (cannot read property undefined)

[Killed] StringLiteral
src/insurance/policy_gate.ts:513:34
       ];
       const shouldRedact = this.mode === "redact";
       return {
-        decision: shouldRedact ? "rewrite" : "allow",
+        decision: shouldRedact ? "" : "allow",
         reasonCodes,
         severity: shouldRedact ? 3 : 1,
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: ""

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:528:9
     depth: number,
     seen: WeakSet<object>,
   ): { redactedValue: unknown; detectedTypes: string[] } {
-    if (depth > this.maxMetadataDepth) {
+    if (false) {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck metadata scanning should respect maxMetadataDepth and stop scanning deep objects
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "PII_DETECTED:EMAIL"
Received array:     ["PII_DETECTED", "PII_DETECTED:EMAIL"]

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:528:9
     depth: number,
     seen: WeakSet<object>,
   ): { redactedValue: unknown; detectedTypes: string[] } {
-    if (depth > this.maxMetadataDepth) {
+    if (true) {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BooleanLiteral
src/insurance/policy_gate.ts:540:9
       };
     }
 
-    if (!value || typeof value !== "object") {
+    if (value || typeof value !== "object") {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:541:53
     }
 
     if (!value || typeof value !== "object") {
-      return { redactedValue: value, detectedTypes: [] };
+      return { redactedValue: value, detectedTypes: ["Stryker was here"] };
     }
 
killedBy: PIIRedactorCheck clean text should allow text with no PII
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:541:14
     }
 
     if (!value || typeof value !== "object") {
-      return { redactedValue: value, detectedTypes: [] };
+      return {};
     }
 
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: TypeError: metadataResult.detectedTypes is not iterable

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:544:9
       return { redactedValue: value, detectedTypes: [] };
     }
 
-    if (seen.has(value)) {
+    if (false) {
       return { redactedValue: value, detectedTypes: [] };
     }

[NoCoverage] ArrayDeclaration
src/insurance/policy_gate.ts:545:53
     }
 
     if (seen.has(value)) {
-      return { redactedValue: value, detectedTypes: [] };
+      return { redactedValue: value, detectedTypes: ["Stryker was here"] };
     }
     seen.add(value);

[Survived] ArrayDeclaration
src/insurance/policy_gate.ts:569:37
 
     const record = value as Record<string, unknown>;
     const redactedRecord: Record<string, unknown> = {};
-    const detectedTypes: string[] = [];
+    const detectedTypes: string[] = ["Stryker was here"];
 
     for (const [key, entry] of Object.entries(record)) {

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:644:38
     const allReasonCodes: string[] = [];
     const completedCheckInputs: OpaCheckInput[] = [];
 
-    let winningResult: CheckResult = {
-      decision: "allow",
-      reasonCodes: [],
-      severity: 0,
-    };
+    let winningResult: CheckResult = {};
 
     for (const check of this.checks) {
killedBy: PolicyGate should return allow when no checks are configured
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: undefined

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:670:10
 
       if (
         newPriority > currentPriority ||
-        (newPriority === currentPriority &&
+        (true &&
           result.severity > winningResult.severity)
       ) {

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:679:9
       // Short-circuit: no check can override cancel_output, and critical
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
-        winningResult.decision === "cancel_output" ||
+        false ||
         (winningResult.severity >= 4 &&
           (winningResult.decision === "refuse" ||
killedBy: PolicyGate + OpaEvaluator integration short-circuit still limits checks passed to OPA
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"isFinal": true, "role": "assistant", "sessionId": "test-session", "text": "Hello there"}

[Killed] BlockStatement
src/insurance/policy_gate.ts:688:43
       }
     }
 
-    if (this.opaEvaluator?.isInitialized) {
-      const opaOutput = this.opaEvaluator.evaluate({
-        checks: completedCheckInputs,
-      });
-      return {
-        decision: opaOutput.decision,
-        reasonCodes: allReasonCodes,
-        severity: opaOutput.severity,
-        safeRewrite: opaOutput.safeRewrite ?? undefined,
-        requiredDisclaimerId: opaOutput.requiredDisclaimerId ?? undefined,
-        checkDurationMs: Date.now() - start,
-        checksRun,
-      };
-    }
+    if (this.opaEvaluator?.isInitialized) {}
 
     return {
killedBy: PolicyGate + OpaEvaluator integration with initialized OpaEvaluator: uses OPA result for decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cancel_output"
Received: "refuse"

[Killed] OptionalChaining
src/insurance/policy_gate.ts:688:9
       }
     }
 
-    if (this.opaEvaluator?.isInitialized) {
+    if (this.opaEvaluator.isInitialized) {
       const opaOutput = this.opaEvaluator.evaluate({
         checks: completedCheckInputs,
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: TypeError: Cannot read properties of undefined (reading 'isInitialized')
