[Killed] ObjectLiteral
src/insurance/policy_gate.ts:689:52
     }
 
     if (this.opaEvaluator?.isInitialized) {
-      const opaOutput = this.opaEvaluator.evaluate({
-        checks: completedCheckInputs,
-      });
+      const opaOutput = this.opaEvaluator.evaluate({});
       return {
         decision: opaOutput.decision,
killedBy: PolicyGate + OpaEvaluator integration short-circuit still limits checks passed to OPA
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined
