[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:370:16
     if (this.state === "A_PLAYING") {
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "user_barge_in");
-    } else if (this.state === "B_PLAYING") {
+    } else if (this.state !== "B_PLAYING") {
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
killedBy: LaneArbitrator barge-in handling should emit stop_lane_b on barge-in during Lane B
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
